ERP.belugaerp/src/Documents/ПересортицаТоваров/ПересортицаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПересортицаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <attributes>
    <name>бг_НеРегистрироватьКОтражениюВРеглУчете</name>
    <comment>Если установлено значение &quot;Да&quot;, то проводки формироваться не будут</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Основание</name>
    <type>
      <types>DocumentRef.ТТНВходящаяЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СерияОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НазначениеОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямПродукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Enums/бг_ВариантыОтложеннойОбработкиОбъектов/бг_ВариантыОтложеннойОбработкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ВариантыОтложеннойОбработкиОбъектов</name>
  <enumValues>
    <name>АвтоСогласованиеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьОбеспечениеЗаказовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ИзменитьДатуСвязанныхУчетныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьАкцизныеМарки</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьДокументыWMS</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьНовуюОрганизациюЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьПрисоединенныйФайлПисьма</name>
  </enumValues>
  <enumValues>
    <name>ОтправитьЗапросыСправки1ЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ОтразитьДополнительныеСведенияЗаказаКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПередатьЗаказыКлиентовНаСборку</name>
  </enumValues>
  <enumValues>
    <name>ПерезаполнитьЗаявкиНаРасходованиеДС</name>
    <comment>Проект &quot;Магистраль&quot;</comment>
  </enumValues>
  <enumValues>
    <name>РассчитатьПоказателиРаботыОператоровWMS</name>
  </enumValues>
  <enumValues>
    <name>СоздатьИзменитьПодчиненнуюРеализацию</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЗаказМагазина</name>
  </enumValues>
  <enumValues>
    <name>СоздатьНоменклатуруПартнера</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДокументы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьИнтернетЗаказыКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРейсы</name>
  </enumValues>
  <enumValues>
    <name>СформироватьДвиженияМарок</name>
  </enumValues>
  <enumValues>
    <name>СформироватьОрдераНаОтражениеПересортицы</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьРезервыПриПоступленииТовара</name>
  </enumValues>
  <enumValues>
    <name>СформироватьПриходныйОрдерНаТовары</name>
  </enumValues>
  <enumValues>
    <name>СформироватьРасходныйОрдерНаТовары</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПеремещениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ГрузSolvo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗагруженИзУПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерДокументаУПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПодотчетноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СозданПоЗаданиюSolvo</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПеремещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЗаказНаПеремещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/ОрдерНаОтражениеПересортицыТоваров/ОрдерНаОтражениеПересортицыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОрдерНаОтражениеПересортицыТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_Распоряжение</name>
    <type>
      <types>DocumentRef.ПересортицаТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/ПересортицаТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает документ пересортицы товаров на основании ТТН входящей
//
// Параметры:
//  ТТНВходящая	- ДокументСсылка.ТТНВходящаяЕГАИС 
//
Процедура бг_СоздатьДокументПересортицыТоваровНаОснованииТТНВходящей(ТТНВходящая) Экспорт
	
	ПересортицаТоваровОбъект = Документы.ПересортицаТоваров.СоздатьДокумент();
	ПересортицаТоваровОбъект.Заполнить(ТТНВходящая);
	
	ПересортицаТоваровОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
КонецПроцедуры

// Связанный с ТТН входящей документ пересортицы
//
// Параметры:
//  ТТНВходящая	- - ДокументСсылка.ТТНВходящаяЕГАИС
// 
// Возвращаемое значение:
// 	ДокументСсылка.ПересортицаТоваров 
//
Функция бг_ДокументПересортицыТоваровНаОснованииТТНВходящей(ТТНВходящая) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПересортицаТоваров.Ссылка КАК ПересортицаТоваров
	|ИЗ
	|	Документ.ПересортицаТоваров КАК ПересортицаТоваров
	|ГДЕ
	|	ПересортицаТоваров.бг_Основание = &ТТНВходящая
	|	И ПересортицаТоваров.Проведен";
	
	Запрос.УстановитьПараметр("ТТНВходящая", ТТНВходящая);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ПересортицаТоваров;
	
КонецФункции

// Интерфейс для отложенной обработки этапов производства
//
// Параметры:
//   Объект - ДокументСсылка.ЭтапПроизводства2_2
//   ВариантОбработки - ПеречислениеСсылка.бг_ВариантыОтложеннойОбработкиОбъектов, Неопределено - вариант обработки
//   Отказ - Булево - отказ от обработки
//   ДополнительныеСведения - Структура - дополнительные сведения для обработки
//
Процедура бг_ОтложеннаяОбработкаОбъекта(Объект, ВариантОбработки, Отказ,
	ДополнительныеСведения = Неопределено) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ВариантОбработки =
			Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов.СформироватьОрдераНаОтражениеПересортицы Тогда
			
		бг_СформироватьОбновитьОрдер(Объект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция бг_ДанныеЗаполненияПересортицыТоваровНаОснованииТТНВходящей(ТТНВходящая) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТТНВходящаяЕГАИС.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ОснованиеТТНВходящей
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС КАК ТТНВходящаяЕГАИС
	|ГДЕ
	|	ТТНВходящаяЕГАИС.Ссылка = &ТТНВходящая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТТНВходящаяЕГАИС.Ссылка КАК бг_Основание,
	|	ТТНВходящаяЕГАИС.Организация КАК Организация,
	|	ТТНВходящаяЕГАИС.ТорговыйОбъект КАК Склад,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС) КАК ВидДеятельностиНДС,
	|	ИСТИНА КАК ПриходоватьТоварыПоСебестоимостиСписания,
	|	ИСТИНА КАК бг_НеРегистрироватьКОтражениюВРеглУчете
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС КАК ТТНВходящаяЕГАИС
	|ГДЕ
	|	ТТНВходящаяЕГАИС.Ссылка = &ТТНВходящая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТТНВходящаяЕГАИСТовары.Номенклатура КАК НоменклатураОприходование,
	|	ТТНВходящаяЕГАИСТовары.Характеристика КАК ХарактеристикаОприходование,
	|	ТТНВходящаяЕГАИСТовары.Серия КАК СерияОприходование,
	|	ТТНВходящаяЕГАИСТовары.Количество КАК Количество
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС.Товары КАК ТТНВходящаяЕГАИСТовары
	|ГДЕ
	|	ТТНВходящаяЕГАИСТовары.Ссылка = &ТТНВходящая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.Характеристика КАК Характеристика,
	|	ПеремещениеТоваровТовары.Серия КАК Серия,
	|	ПеремещениеТоваровТовары.Количество КАК Количество
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ОснованиеТТНВходящей.ДокументОснование
	|			ИЗ
	|				ОснованиеТТНВходящей КАК ОснованиеТТНВходящей)";
	
	Запрос.УстановитьПараметр("ТТНВходящая", ТТНВходящая);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ДанныеДляСоздания = Новый Структура;
	ДанныеДляСоздания.Вставить("ДанныеДокумента", ПакетРезультатов[1]);
	ДанныеДляСоздания.Вставить("ДанныеТабличнойЧастиТТНВходящей", ПакетРезультатов[2]);
	ДанныеДляСоздания.Вставить("ДанныеТабличнойЧастиПеремещенияТоваров", ПакетРезультатов[3]);
	
	Возврат ДанныеДляСоздания;
		
КонецФункции

Функция ИнициализироватьИтоговуюТаблицуТабличнойЧасти() Экспорт

	ИтоговаяТаблица = Новый ТаблицаЗначений;
	ИтоговаяТаблица.Колонки.Добавить("Номенклатура");
	ИтоговаяТаблица.Колонки.Добавить("Характеристика");
	ИтоговаяТаблица.Колонки.Добавить("Серия");
	ИтоговаяТаблица.Колонки.Добавить("НоменклатураОприходование");
	ИтоговаяТаблица.Колонки.Добавить("ХарактеристикаОприходование");
	ИтоговаяТаблица.Колонки.Добавить("СерияОприходование");
	ИтоговаяТаблица.Колонки.Добавить("Количество");
	
	Возврат ИтоговаяТаблица;
	
КонецФункции

Процедура бг_СформироватьОбновитьОрдер(Распоряжение)
	ДанныеРаспоряжения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "Проведен, ПометкаУдаления");
	
	ДанныеОрдер = бг_ОрдерНаОтражениеПересортицы(Распоряжение);
	
	Если ДанныеРаспоряжения.Проведен Тогда
		Если ДанныеОрдер = Неопределено Тогда
			ОрдерОбъект = Документы.ОрдерНаОтражениеПересортицыТоваров.СоздатьДокумент();
			ОрдерОбъект.Дата = ТекущаяДатаСеанса();
		Иначе
			ЗаблокироватьДанныеДляРедактирования(ДанныеОрдер.Ссылка);
			ОрдерОбъект = ДанныеОрдер.Ссылка.ПолучитьОбъект();
			ОрдерОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;
		
		ОрдерОбъект.Заполнить(Распоряжение);
		ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли ДанныеОрдер <> Неопределено Тогда
		Если ДанныеОрдер.Проведен
			Или ДанныеРаспоряжения.ПометкаУдаления И Не ДанныеОрдер.ПометкаУдаления Тогда
			
			ОрдерСсылка = ДанныеОрдер.Ссылка;
			ЗаблокироватьДанныеДляРедактирования(ОрдерСсылка);
			
			ОрдерОбъект = ОрдерСсылка.ПолучитьОбъект();
			ОрдерОбъект.ПометкаУдаления = ДанныеРаспоряжения.ПометкаУдаления;
			ОрдерОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция бг_ОрдерНаОтражениеПересортицы(Распоряжение)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОрдерНаОтражениеПересортицыТоваров.Ссылка КАК Ссылка,
	|	ОрдерНаОтражениеПересортицыТоваров.ПометкаУдаления КАК ПометкаУдаления,
	|	ОрдерНаОтражениеПересортицыТоваров.Проведен КАК Проведен
	|ИЗ
	|	Документ.ОрдерНаОтражениеПересортицыТоваров КАК ОрдерНаОтражениеПересортицыТоваров
	|ГДЕ
	|	ОрдерНаОтражениеПересортицыТоваров.бг_Распоряжение = &Распоряжение";
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Ссылка, ПометкаУдаления, Проведен",
			Выборка.Ссылка, Выборка.ПометкаУдаления, Выборка.Проведен);
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

#КонецОбласти

#КонецЕсли
